<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<BASE HREF="http://www.cd32-allianz.de/cdxl/v1"><table border=1 width=100%><tr><td><table border=1 bgcolor=#ffffff cellpadding=10 cellspacing=0 width=100% color=#ffffff><tr><td><font face=arial,sans-serif color=black size=-1>Dies ist der <a href="http://www.google.com/intl/de/help/features.html#cached"><font color=blue>Zwischenspeicher</font></a> von <b><font color=#0039b6>G</font> <font color=#c41200>o</font> <font color=#f3c518>o</font> <font color=#0039b6>g</font> <font color=#30a72f>l</font> <font color=#c41200>e</font></b> für <A HREF="http://www.cd32-allianz.de/cdxl/v1"><font color=blue>http://www.cd32-allianz.de/cdxl/v1</font></a> nach dem Stand vom 2. Mai 2006 04:38:31 GMT.<br>
<b><font color=#0039b6>G</font> <font color=#c41200>o</font> <font color=#f3c518>o</font> <font color=#0039b6>g</font> <font color=#30a72f>l</font> <font color=#c41200>e</font></b>s Cache enthält einen Schnappschuss der Webseite, der während des Webdurchgangs aufgenommenen wurde.<br>
Unter Umständen wurde die Seite inzwischen verändert. Klicken Sie hier, um zur <A HREF="http://www.cd32-allianz.de/cdxl/v1"><font color=blue>aktuellen Seite</font></a> ohne Hervorhebungen zu gelangen.<br>
Diese Seite im Cache bezieht sich eventuell auf Bilder, die nicht länger zur Verfügung stehen. Klicken Sie hier, um nur den <A HREF="http://66.249.93.104/search?q=cache:nTlLaBALkhoJ:www.cd32-allianz.de/cdxl/v1+amiga+format+cdxl&hl=de&lr=&strip=1"><font color=blue>Text im Cache</font></a> anzuzeigen.<br>Um einen Link oder ein Bookmark zu dieser Seite herzustellen, benutzen Sie bitte die folgende URL: <code>http://www.google.com/search?q=cache:nTlLaBALkhoJ:www.cd32-allianz.de/cdxl/v1+amiga+format+cdxl&amp;hl=de&amp;gl=de&amp;ct=clnk&amp;cd=4</code></font><br><br><center><font size=-2><i>Google steht zu den Verfassern dieser Seite in keiner Beziehung.</i></font></center></td></tr>
<tr><td>
<table border=0 cellpadding=0 cellspacing=0><tr><td><font face=arial,sans-serif color=black size=-1>Diese Suchbegriffe wurden hervorgehoben:&nbsp;</font></td><td bgcolor=#ffff66><B><font face=arial,sans-serif color=black size=-1>amiga&nbsp;</font></B></td><td bgcolor=#a0ffff><B><font face=arial,sans-serif color=black size=-1>format&nbsp;</font></B></td><td bgcolor=#99ff99><B><font face=arial,sans-serif color=black size=-1>cdxl&nbsp;</font></B></td></tr></table>
</td></tr></table></td></tr></table>
<hr>
<html><head><title>CDXL</title><link rel="stylesheet" type="text/css" href="http://static.cd32-allianz.de/cd32.css"></link></head><body leftmargin="0" topmargin="0" marginwidth="0" marginheight="0" bgcolor="#ffffff" link="#0000cc" vlink="#cc0000" text="#000000"><table width="97%" cellpadding="0" cellspacing="0" border="0" align="center"><tr><td bgcolor="#ffffff"><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="3"></td></tr><tr><td bgcolor="#ffffff"><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="6"></td></tr><tr><td bgcolor="#ffffff" class="titelText"><div align="center"><h2><font color="#000000" face="verdana"><b><b style="color:black;background-color:#99ff99">CDXL</b></b></font></h2></div></td></tr><tr><td bgColor="#ffcc66"><img height="6" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td bgColor="#ffffff"><img height="3" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b></b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Willkommen auf der <b style="color:black;background-color:#99ff99">CDXL</b>-Seite. Auf dieser Seite behandeln wir das <b style="color:black;background-color:#99ff99">CDXL</b>-<b style="color:black;background-color:#a0ffff">Format</b> mittels eines ziemlich ausf&uuml;hrlichen Berichts von Christian Effenberger,
   der dieses <b style="color:black;background-color:#a0ffff">Format</b> erkl&auml;rt. Alle was hier angesprochen wird, wird man auch hier downloaden k&ouml;nnen. Jetzt hoffe ich mal,
   das das <b style="color:black;background-color:#99ff99">CDXL</b>-<b style="color:black;background-color:#a0ffff">Format</b> euer Interesse geweckt hat und man schon bald eigene Werke von euch begutachten kann.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Alles was ihr f&uuml;r das <b style="color:black;background-color:#99ff99">CDXL</b>-<b style="color:black;background-color:#a0ffff">Format</b> braucht, kann jetzt kostenlos hier runtergeladen werden!</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><a href="http://static.cd32-allianz.de/downloads/software/cdxldtc012.lha">cdxldtc012.lha</a> Download <b style="color:black;background-color:#99ff99">CDXL</b>-Datatype</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><b style="color:black;background-color:#99ff99">cdxl</b>-ws.lha (leider ist die Datei nicht mehr aufzufinden) Download <b style="color:black;background-color:#99ff99">CDXL</b>-Player & Gui</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Falls es Probleme mit dem Abspielen von <b style="color:black;background-color:#99ff99">CDXL</b>-Filmen gibt, so liegt das daran das sich die "cdgsxl-Datei" nicht in ihrem c: Verzeichnis auf der Festplatte befindet.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><a href="http://static.cd32-allianz.de/downloads/software/cdgsxl.lha">cdgsxl.lha</a> Download cdgsxl-Datei</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><p align="right">Alle in diesem Artikel referenzierten Daten sind auf der CD-Rom des <b style="color:black;background-color:#ffff66">Amiga</b>-Magazins 7/97 zu finden!</p><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b></b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   »<b style="color:black;background-color:#99ff99">CDXL</b>« ist ein Animationsformat, das von Commodore Ende der 80er Jahre f&uuml;r das damals noch brandneue CDTV (Sie erinnern sich;
   die Kreuzung aus A-500 und CD-Player im Hifi-Lock) entwickelt wurde. Das <b style="color:black;background-color:#a0ffff">Format</b> sollte eine Tonspur enthalten und direkt vom Medium abspielbar sein.
   Unter den gegebenen Voraussetzungen eines 68000 Prozessors, eines Laufwerks mit 150 Kb/sek. und maximal 4096 Farben ergaben sich nat&uuml;rlich nur relativ geringe Dimensionen.
   Bei 160x100 in HAM6 mit 11025 Hz 8bit Mono und 12 Bildern pro Sekunde lag damal das absolute Maximum. Durch die unkomprimiert vorliegenden
   Bild- und Ton-Daten wurde sichergestellt, das ein f&uuml;r heutige Verh&auml;ltnisse langsamer Prozessor wie der 68000er die anfallende Datenmenge schnell
   genug in den Speicher schaufeln konnte. Zu dieser Zeit gab es weder AVI noch QuickTime und somit war das <b style="color:black;background-color:#99ff99">CDXL</b>-<b style="color:black;background-color:#a0ffff">Format</b> damals im Bereich der Personal Computer einmalig.
   Aber auch Heute noch bietet sich <b style="color:black;background-color:#99ff99">CDXL</b> geradezu als Alternative zum ANIM-<b style="color:black;background-color:#a0ffff">Format</b> an. Es bietet die M&ouml;glichkeit einen vertonten Film
   auf jedem <b style="color:black;background-color:#ffff66">Amiga</b> bei gleichbleibender Geschwindigkeit direkt vom Medium abzuspielen, egal wie gro&szlig; der Film auch immer sein mag.
   Das bedeutet: ein 3 min&uuml;tiger Kinotrailer (60 Mb) direkt von Platte oder CD-Rom (DoubleSpeed), mit Ton und in einer Qualit&auml;t die sich vor der
   von AVI-Filmen nicht zu verstecken braucht, auf einem A-500 mit 1 Mb Speicher und OS 3.x. ...nah, w&auml;r das was f&uuml;r Sie?
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><p align="center"><img border="0" src="http://static.cd32-allianz.de/images/cdxl/bild1.gif"></p>Abbildung [1] Die Playeroberfl&auml;che »cdgsxlGUI2«</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Dieser Artikel soll Ihnen die Grundlagen vermitteln, um mit den Programmen »cdgsxlGUI2« und »XLToolKitGUI«, in k&uuml;rzester zeit ansprechende Filme zu erstellen.
   Das Programmpaket unterteilt sich in den eigentlichen FilmEditor »XLToolKitGUI« und den FilmPlayer »cdgsxlGUI2«, sowie einige BeispielFilme und sonstige Dateien.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><p align="center"><img border="0" src="http://static.cd32-allianz.de/images/cdxl/bild2.gif"></p>Abbildung [2] HAM6 Film auf HiRes Hintergrundbild (AGA)</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Zum besseren Verst&auml;ndni&szlig;, und damit Sie einen Eindruck vom sp&auml;teren Ergebnis erhalten, werfen Sie doch einmal einen Blick auf die Abbildungen [2]&[3].
   Was Sie sehen ist die Bildschirmseite eines <b style="color:black;background-color:#99ff99">CDXL</b>-Filmes der auf einem Hintergrundbild abgespielt wird.
   Der Film liegt im HAM6 <b style="color:black;background-color:#a0ffff">Format</b> vor, und kann deswegen sowohl auf einem LoRes-Bildschirm f&uuml;r ECS-Rechner [3] abgespielt werden,
   als auch auf einem HiRes-Bildschirm f&uuml;r AGA-Rechner [2]. Das Hintergrundbild wurde so pr&auml;pariert,
   das es trotz wechselnder BildPaletten des Films sein Aussehen nicht ver&auml;ndert. Sie merken schon, <b style="color:black;background-color:#99ff99">CDXL</b> bietet ungewohnte M&ouml;glichkeiten zur Pr&auml;sentation an.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><p align="center"><img border="0" src="http://static.cd32-allianz.de/images/cdxl/bild3.gif"></p>Abbildung [3] HAM6 Film auf LoRes Hintergrundbild (ECS)</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Nach erfolgreicher Installation der ben&ouml;tigten Bibliotheken mittels des mitgelieferten Installationsskriptes,
   sollten Sie die Voreinstellungspfade beider Programme in den ToolTypes der Piktogramme nach ihren Bed&uuml;rfnissen anpassen.
   Beide Programme passen sich &uuml;brigens automatisch an die verwendete Sprache ihrer Workbench an. Falls Sie keine deutsche Workbench benutzen,
   werden die Programme mit einer englischen Benutzerf&uuml;hrung gestartet. Bitte vergessen Sie nicht das beide Programme im Prinzip nur graphische Benutzeroberfl&auml;chen
   f&uuml;r reine CLI-Programme darstellen. Deshalb m&uuml;ssen Sie selbst sicherstellen, das sich diese CLI-Programme in dem Pfad befinden, den Sie als ToolType vorgegeben haben.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Nun haben Sie alle Vorbereitungen getroffen, um mit der Erstellung eines Filmes beginnen zu k&ouml;nnen. Zuvor sollten Sie aber einmal, je nach Ausstattung,
   eines der beiden Icons 'DropZone.ECS' oder 'DropZone.AGA' anklicken, um sich einen Eindruck von den Formatqualit&auml;ten zu verschaffen.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><p align="center"><img border="0" src="http://static.cd32-allianz.de/images/cdxl/bild4.gif"></p>Abbildung [4] Die Editoroberfl&auml;che »XLToolKitGUI«</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Schritt 1:</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Nachdem Sie XLToolKitGUI gestartet haben, befinden Sie sich auf der Hauptsteuertafel (siehe Abbildung [4]).
   Die sichtbaren Kn&ouml;pfe in Form von Karteikartenreitern am oberen Fensterrand zeigen das Spektrum der Bearbeitungsm&ouml;glichkeiten an.
   Da wir einen Film erstellen m&ouml;chten, klicken Sie bitte auf den Knopf »Erstellen«. Falls die nachfolgenden Beschreibungen f&uuml;r Ihren Geschmack nicht ausf&uuml;hrlich genug sind,
   k&ouml;nnen Sie jederzeit die kontextsensitive OnLine-Hilfe durch einen Druck auf die Taste »Help«, oder durch Anwahl des Men&uuml;punktes »Hilfe« aufrufen.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Schritt 2:</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Klicken Sie bitte auf den Knopf »Einf&uuml;gen« unterhalb der Liste. In dem jetzt ge&ouml;ffneten DateiRequester w&auml;hlen Sie bitte den Film 'Walker.<b style="color:black;background-color:#99ff99">CDXL</b>' aus.
   Hierbei handelt es sich um die uns&auml;gliche Demonstrantion eines <b style="color:black;background-color:#99ff99">CDXL</b>-Filmes von Commodore. Genau diesen Film werden wir aus einzelnen Bildern
   und einer Tondatei zusammenstellen. Wenn Sie den Eintrag in der Liste doppelt anklicken,
   wird auf der rechten Seite ein Dokument mit umfangreichen Informationen zum Film angezeigt.
   Um zum Abspielen des Filmes nicht auf die Karteikarte »Abspielen« wechseln zu m&uuml;ssen, k&ouml;nnen sie jederzeit einen Film aus der Liste abspielen,
   indem sie den Auswahlknopf direkt unter der Liste anklicken. Nun aber zur&uuml;ck zur Erstellung unseres Beispielfilmes.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Schritt 3:</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Die Einstellungsm&ouml;glichkeiten »interleaved« »HAM« und »AVM« bleiben alle deaktiviert. Daf&uuml;r klicken Sie bitte auf den DateiSymbolKnopf neben »Name des Films«.
   In dem jetzt ge&ouml;ffneten DateiRequester geben Sie Pfad und Namen des zu erstellenden Filmes an.
   Das Gleiche bitte nochmal bei »Basisname der Bilder«. W&auml;hlen sie dazu das erste Bild 'B.0001' aus dem Verzeichnis 'SinglePics/' aus.
   Wenn Sie sich die Nummer des letzten Bildes gemerkt haben, k&ouml;nnen Sie diesen Wert (25) unter »Anzahl der Bilder« eintragen.
   Wenn Sie bei »Basisname der Bilder« den Knopf mit dem Pfeil nach unten anklicken, wird das gew&auml;hlte Bild per MultiView angezeigt.
   Wenn Sie aber gleichzeitig die Taste »Shift« dr&uuml;cken, k&ouml;nnen Sie ein Verzeichnis ausw&auml;hlen, dessen Bilder dann alle nacheinander auf einen eigenen Bildschirm geblittet werden.
   Probieren Sie es mal aus. Jetzt m&uuml;ssen wir noch die ben&ouml;tigte Anzahl der Audio Bytes ermitteln. Dazu klicken Sie bitte einmal auf den SymbolKnopf mit dem Pfeil nach links,
   direkt neben dem Text »Audio bytes/Bild«. In dem jetzt ge&ouml;ffneten DateiRequester geben Sie Pfad und Namen der zu verwendenden Tondatei an ('Sounds/Walker.SND').
   Daraufhin wird unter Verwendung der voreingestellten Anzahl der Bilder pro Sekunde (siehe Men&uuml;...), der Wert f&uuml;r die Audiobytes berechnet und eingetragen.
   Der Knopf rechts daneben dient zum Abspielen der Tondatei mittels Multiview. Die eigentliche Ausf&uuml;hrung der ganzen Operation wird durch den Knopf »Film Erstellen« eingeleitet.
   Also klicken Sie diesen jetzt bitte einmal an.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Schritt 4:</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Unser Film ist jetzt eigentlich fertig. Aber halt, da fehlt noch etwas. Der Ton ist nicht enthalten.
   Bei der Erstellung eines Filmes werden n&auml;mlich nur Nullbytes f&uuml;r den Ton belegt, quasi als Platzhalter. F&uuml;gen Sie den fertigen Film in die Liste ein,
   indem Sie einfach auf den Knopf mit dem Pfeil nach links klicken. Mit einem Doppelklick auf den Listeneintrag erhalten Sie Informationen zum Film.
   Wenn Sie den Ton jetzt noch einf&uuml;gen m&ouml;chten, m&uuml;ssen Sie zuerst auf die gleichnamige Karteikarte »Einf&uuml;gen« wechseln.
   Danach klicken Sie bitte auf den SymbolKnopf mit dem Pfeil nach rechts, neben »Name des Films«. Schon haben Sie den gerade erstellten Film eingesetzt.
   F&uuml;r den Ton geben Sie im DateiRequester die zu verwendenden Tondatei an ('Sounds/Walker.SND'),
   und die Anzahl der Audio Bytes werden wieder durch einen Klick auf den Knopf mit dem Pfeil nach rechts eingesetzt.
   Die eigentliche Ausf&uuml;hrung der ganzen Operation wird durch den Knopf »Ton Einf&uuml;gen« eingeleitet. Also klicken Sie diesen jetzt bitte einmal an.
   Nun ist der Film entg&uuml;ltig fertig.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Die beschriebene Erstellung eines Filmes soll nat&uuml;rlich nur exemplarisch f&uuml;r eine m&ouml;gliche Vorgehensweise stehen.
   Diese kurze Einleitung kann auch nicht alle M&ouml;glichkeiten und Bearbeitungsformen aufzeigen.
   F&uuml;r weiterf&uuml;hrende Erl&auml;uterungen bedienen Sie sich bitte der mitgelieferten OnLine-Hilfe. Noch ein Wort zu den mitgelieferten Filmen.
   Da das <b style="color:black;background-color:#99ff99">cdxl</b>.datatype auf dem sound.datatype und dem animation.datatype aufbaut, und diese beiden weder Stereo noch wechselnde Paletten unterst&uuml;tzen,
   kann Multiview leider nicht alle Filme korrekt abspielen. Hinzu kommt noch, das das <b style="color:black;background-color:#99ff99">cdxl</b>.datatype alle Filme grunds&auml;tzlich mit 150 Kb/Sek. wiedergibt.
   Deswegen habe ich au&szlig;er mit 'DropZone.<b style="color:black;background-color:#99ff99">CDXL</b>' nur Filme beigelegt, die auch unter Multiview zufriedenstellend abspielbar sind.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Zum Schlu&szlig; bleibt mir nur, Ihnen viel Spa&szlig; und Erfolg bei der Arbeit mit Ihren <b style="color:black;background-color:#99ff99">CDXL</b>-Filmen zu w&uuml;nschen.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">© 1997 by Christian Effenberger</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Was sind cdgsxlGUI2 und XLToolKitGUI?</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Das Programm cdgsxlGUI2 dient als graphische Oberfl&auml;che f&uuml;r den <b style="color:black;background-color:#99ff99">CDXL</b>-Player cdgsxl von Wayne D. Lutz. Es eignet sich hervorragend zum Abspielen von <b style="color:black;background-color:#99ff99">CDXL</b>-Filmen.
   Im Lieferumfang befinden sich AmigaGuide-Dateien zur OnLine-Hilfe in Deutsch und Englisch. Nicht im Lieferumfang enthalten ist das CLI-Programm cdgsxl.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Das Programm XLToolKitGUI dient als graphische Oberfl&auml;che f&uuml;r die CLI-Programme des <b style="color:black;background-color:#99ff99">CDXL</b> Toolkit V1.10 von Pantaray Inc. und den <b style="color:black;background-color:#99ff99">CDXL</b>-Player cdgsxl von
   Wayne D. Lutz. Es eignet sich hervorragend f&uuml;r die Erstellung und Bearbeitung von <b style="color:black;background-color:#99ff99">CDXL</b>-Filmen.
   Im Lieferumfang befinden sich AmigaGuide-Dateien zur OnLine-Hilfe in Deutsch und Englisch. Nicht im Lieferumfang enthalten sind die ben&ouml;tigten CLI-Programme:
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">XLAudio, XLClean, XLCopy, XLIff, XLInfo, XLJoin, XLMake, XLTrim und cdgsxl.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Das <b style="color:black;background-color:#99ff99">CDXL</b> Toolkit von Pantaray Inc. finden Sie auf der '<b style="color:black;background-color:#ffff66">Amiga</b> Developer CD-Rom'. Den <b style="color:black;background-color:#99ff99">CDXL</b> Player cdgsxl von Wayne D. Lutz finden Sie auf dem 'AmiNet Set 2b'.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Welchen Status haben cdgsxlGUI2 und XLToolKitGUI?</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">»cdgsxlGUI2« und »XLToolKitGUI« sind sogenannte »Shareware«-Programm. Die Version auf den PD-Disketten des AmigaMagazins sind in ihrer Nutzung ohne Einschr&auml;nkung.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Wo kann mann die Programme erhalten? z.B. AmiNet, AmigaMagazin PD-Disketten</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Wo kann mann den Player »cdgsxl« finden? z.B. AmiNet Set 2b</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Wo kann mann das »<b style="color:black;background-color:#99ff99">CDXL</b> ToolKit« finden? z.B. <b style="color:black;background-color:#ffff66">Amiga</b> Developer CD-Rom</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Wie hoch ist die Sharewaregeb&uuml;hr f&uuml;r die Programme? »cdgsxlGUI2« und »XLToolKitGUI« jeweils: 10,- DM oder 10,- $</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Welche Systemvoraussetzungen stellen cdgsxlGUI2 und XLToolKitGUI?</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">»cdgsxlGUI2« - OS 2.x, min. 2 Mb FAST, min. 0.5 Mb CHIP, ECS</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">»XLToolKitGUI« - OS 2.x, min. 2 Mb FAST, min. 0.5 Mb CHIP, ECS</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Grafikkarten? Beide Programme k&ouml;nnen grunds&auml;tzlich auf Grafikarten laufen. Bei Bedarf kann per ToolType ein PublicScreen vorgegeben werden.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">MERKE: Zwar laufen »cdgsxlGUI2« und »XLToolKitGUI« ab OS 2.x, aber sowohl der Player »cdgsxl« als auch »MultiView« ben&ouml;tigen zum Betrieb unbedingt OS 3.x.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Was wird sonst noch ben&ouml;tigt?</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Zur Generierung von Einzelbildern (eventuell aus vorhandenen Animationen) bieten sich zum Beispiel nachfolgende Programmpakete an.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Kommerzielle Software</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Adorage<br>
   Animage<br>
   Art Department Professional (ADPro) und FrameEditor (FRED)<br>
   MainActor Broadcast (extrahiert auch den Ton aus AVI-Dateien)<br>
   Monument Designer<br></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Public Domain</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   BuildAnim<br>
   MainActor<br>
   MainActor Broadcast<br>
   mpeg<br>
   MultiView (mit dumpdtanim zusammen)<br>
   WildFire
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Zur Manipulation von Tondateien (IFF-8SVX) bieten sich eine Unzahl an kommerzieller und Public Domain Software an. Sie haben bestimmt etwas passendes.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Abmessungstabelle f&uuml;r verschiedene konstante Abspielgeschwindigkeiten?</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Bei 300 Kb/Sek. w&uuml;rden ungef&auml;hr 36 Minuten Animation auf eine ISO CD-Rom [640 Mb] passen, was ungef&auml;hr der H&auml;lfte der Video-CD [MPEG-1 ~ 72 min. in 384x280x24] entspricht.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   [1:1] 180x180 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kH<br>
   [5:4] PAL 200x164 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kH<br>
   [4:3] VGA 208x158 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kH<br>
   [3:2] NTSC 224x146 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kH<br>
   [16:9] PAL+ 240x136 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kH<br>
   [2:1] CINEMA 256x128 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kH
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><b style="color:black;background-color:#99ff99">CDXL</b>-Aufl&ouml;sungs-Kombinationen f&uuml;r unterschiedliche CD-Rom Laufwerkstypen, jeweils mit 4096 Farben und 12 bis 24 Bildern pro Sekunde.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   1fach-Speed Laufwerk (150 kB)<br>
   160x100 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kHz<br>
   2fach-Speed Laufwerk (300 kB)<br>
   224x146 in HAM6 mit 12 FPS und 8 Bit Mono in 11.025 kHz<br>
   3fach-Speed Laufwerk (450 kB)<br>
   272x170 in HAM6 mit 12 FPS und 8 Bit Mono in 22.05 kHz<br>
   4fach-Speed Laufwerk (600 kB)<br>
   320x200 in HAM6 mit 12 FPS und 8 Bit Mono in 22.05 kHz<br>
   6fach-Speed Laufwerk (900 kB)<br>
   384x240 in HAM6 mit 12 FPS und 8 Bit Stereo in 22.05 kHz<br>
   8fach-Speed Laufwerk (1200 kB)<br>
   384x274 in HAM6 mit 15 FPS und 8 Bit Stereo in 22.05 kHz<br>
   10fach-Speed Laufwerk (1500 kB)<br>
   384x274 in HAM6 mit 20 FPS und 8 Bit Stereo in 22.05 kHz<br>
   12fach-Speed Laufwerk (1800 kB)<br>
   384x274 in HAM6 mit 24 FPS und 8 Bit Stereo in 22.05 kHz
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b><b style="color:black;background-color:#99ff99">CDXL</b> <b style="color:black;background-color:#a0ffff">F O R M A T</b> - Beschreibung</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Typenbedeutung:</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   BYTE 8 Bit vorzeichenlose ganze Zahl<br>
   WORD 16 Bit vorzeichenlose ganze Zahl im 'Motorola'-Byte-Sex<br>
   LONG 32 Bit vorzeichenlose ganze Zahl im 'Motorola'-Byte-Sex<br></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText"><b style="color:black;background-color:#99ff99">CDXL</b>-<b style="color:black;background-color:#a0ffff">Format</b> Beschreibung [CHUNK]</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   #01 BYTE: $00 {0}   [CUSTOM <b style="color:black;background-color:#99ff99">CDXL</b>]<br>
    or BYTE: $01 {1}   [STANDARD <b style="color:black;background-color:#99ff99">CDXL</b>]<br>
    or BYTE: $02 {2}   [SPECIAL <b style="color:black;background-color:#99ff99">CDXL</b>]<br></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Das <b style="color:black;background-color:#99ff99">CDXL</b>-Info-Byte ensteht durch Addition dreier Beschreibungsgruppen:</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   #02 BYTE: $00 {0}   [RGB]  ...VIDEO ENCODING<br>
    or BYTE: $01 {1}   [HAM]<br>
    or BYTE: $02 {2}   [YUV]<br>
    or BYTE: $03 {3}   [AVM & DCTV]<br>
   plus<br><br>
   #02 BYTE: $00 {0}   [BIT PLANAR] ...ORIENTATION<br>
    or BYTE: $20 {32}  [BYTE PLANAR]<br>
    or BYTE: $40 {64}  [CHUNKY]<br>
    or BYTE: $80 {128} [BIT LINE]<br>
    or BYTE: $C0 {192} [BYTE LINE]<br>
   plus<br><br>
   #02 BYTE: $00 {0}   [MONO]     ...AUDIO VALUES<br>
    or BYTE: $10 {16}  [STEREO]<br><br>
   #03 LONG: $0000295C {10588} [CURRENT CHUNKSIZE]<br>
   #04 LONG: $0000295C {10588} [PREVIOUS CHUNKSIZE]<br>
   #05 WORD: $0000 {0}         [RESERVED]<br>
   #06 WORD: $0001 {1}         [CURRENT FRAMENUMBER]<br>
   #07 WORD: $00CB {203}       [BITMAPWIDTH]<br>
   #08 WORD: $005E {94}        [BITMAPHEIGHT]<br>
   #09 WORD: $0004 {4}         [NUMBEROFBITPLANES]<br>
   #10 WORD: $0020 {32}        [COLORMAPSIZE]<br>
   #11 WORD: $02EC {748}       [RAWSOUNDSIZE]<br>
   #12 LONG: $00000000 {0}     [RESERVED]<br>
   #13 LONG: $00000000 {0}     [RESERVED]<br></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">BYTE #32 - #64 [COLORMAP] ; die Pens sind immer WORT-kodiert mit f&uuml;hrenden Nullen d. h. die Palette ist immer 12 Bit (4096 Farben).</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   z.B. 0FFF  oder  0E9A<br><br>
      |||_15      |||_10  ; RGB_Blau_Anteil (0-15)<br>
      ||__15      ||__09  ; RGB_Gr&uuml;n_Anteil (0-15)<br>
      |___15      |___14  ; RGB_Rot_Anteil  (0-15)<br></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">Die Daten liegen immer in dieser Reihenfolge vor:</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   #3  BITMAPDATA      [UNCOMPRESSED BODY]<br>
   #4  SOUNDDATA       [UNCOMPRESSED BODY]<br><br>
   #1  HEADER<br>
   #2  COLORMAPDATA<br>
   #3  BITMAPDATA<br>
   #4  SOUNDDATA<br><br>
   u.s.w. angeordnet.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Womit wurden die Programme geschrieben?</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Mit dem CanDo 3.0 Sourcekodepaket. Auf Sourcelevelniveau ist es ein Kinderspiel solche Programme in wenigen Stunden zu erstellen.
   CanDo eignet sich hervorragend f&uuml;r alle nicht zeitkritischen oder rechenaufwendigen Projekte. Au&szlig;erdem sind alle CanDoProgramme Multitaskingf&auml;hig,
   und verbrauchen im Wartezustand keinerlei Rechenpower. Alle Prozessoren werden unterst&uuml;tzt, inklusive 68881 und 68882.
   Einzige Voraussetzung zum Betrieb ist OS 2.x und min. 2 MB Speicher.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">* Das Sourcekodepaket kann von eingetragenen CanDoBesitzern (ab V2.5) in verschiedenem Lieferumfang bei der INOVAtronics HotLine erworben werden:</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">0 49 - (0) 21 31 / 6 35 94 (Die. & Do. 17°°-19°° Uhr) Tel. & Fax</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">STANDARD - gegen eine ShareWare-Geb&uuml;hr von 30 DM oder 20 $. (Disk)</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">DEVELOPER - gegen eine ShareWare-Geb&uuml;hr von 80 DM oder 50 $. (CD-R)</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table><table width="97%" cellSpacing="0" cellPadding="0" border="0" align="center"><tr><td><img src="http://static.cd32-allianz.de/images/dummy.gif" border="0" width="1" height="20"></td></tr><tr><td class="bigText"><b>Aufruf an alle Programmierer!</b></td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   Der <b style="color:black;background-color:#99ff99">CDXL</b> Player 'cdgsxl' von Wayne D. Lutz ist auf der '<b style="color:black;background-color:#ffff66">Amiga</b> Developer CD-Rom' auch als Quellkode vorhanden.
   Dieses Programm eignet sich hervorragend als Basis f&uuml;r eine sinnvolle Weiterentwicklung des <b style="color:black;background-color:#99ff99">CDXL</b> Formates.
   Unter Beibehaltung der F&auml;higkeit sofort auf jedes Einzelbild zugreifen zu k&ouml;nnen,
   w&auml;re es von Vorteil wenn ein verlustloser schneller Kommpressionsalgorithmus die anfallende Datenmenge wirkungsvoll reduzieren k&ouml;nnte.
   Zum Beispiel ein RunLenght- oder Huffmann-Verfahren. Schon eine Reduzierung auf 40% der Datenmenge w&uuml;rde bei 300 Kb/Sek.
   einen Film mit 15 Bildern pro Sekunde in 320x200x6 und 22.05 KHz 8 bit Stereo m&ouml;glich machen.
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">* Wer Interesse an einer Mitarbeit zur Weiterentwicklung des <b style="color:black;background-color:#99ff99">CDXL</b>-Formates hat, m&ouml;chte sich doch bitte zwecks Koordinierung bei mir melden.</td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr><tr><td class="plainText">
   YOUAN@AMCLUST2.amclust.de (Christian Effenberger)<br>
   Tel. & Fax: 0 49 - (0) 21 31 / 6 35 94
  </td></tr><tr><td><img height="20" src="http://static.cd32-allianz.de/images/dummy.gif" width="1" border="0"></td></tr></table></body></html>